In [1]:
import pandas as pd
import numpy as np

In [5]:
dict1={
    'Name':['Ramesh','Suresh','Sathish',np.nan],
    'Age':[30,33,np.nan,36,],
    'City':[np.nan,'hyd','hyd','bbi']
}

In [7]:
data=pd.DataFrame(dict1)
data

      Name   Age City
0   Ramesh  30.0  NaN
1   Suresh  33.0  hyd
2  Sathish   NaN  hyd
3      NaN  36.0  bbi

In [ ]:
data.isnull().null

In [ ]:
data.to_csv(dict1)

In [ ]:
dropna

 drop the null value data based on  rows and coliumns

In [ ]:
I want to extract the data with out null values

In [9]:
data.dropna()

     Name   Age City
1  Suresh  33.0  hyd

In [11]:
data

      Name   Age City
0   Ramesh  30.0  NaN
1   Suresh  33.0  hyd
2  Sathish   NaN  hyd
3      NaN  36.0  bbi

In [13]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [22]:
dict1={'Name':['Ramesh','Suresh','Sathish',np.nan],
      'Age':[30,33,np.nan,36,],
       'City':[np.nan,'hyd','hyd','bbi'],
       'Company':['Google','microsoft','Apple','wipro']
      }

In [30]:
data1=pd.DataFrame(dict1)
data1

      Name   Age City    Company
0   Ramesh  30.0  NaN     Google
1   Suresh  33.0  hyd  microsoft
2  Sathish   NaN  hyd      Apple
3      NaN  36.0  bbi      wipro

In [34]:
data1.dropna(axis=1)

     Company
0     Google
1  microsoft
2      Apple
3      wipro

In [36]:
data1

      Name   Age City    Company
0   Ramesh  30.0  NaN     Google
1   Suresh  33.0  hyd  microsoft
2  Sathish   NaN  hyd      Apple
3      NaN  36.0  bbi      wipro

In [38]:
data1.fillna(30)

      Name   Age City    Company
0   Ramesh  30.0   30     Google
1   Suresh  33.0  hyd  microsoft
2  Sathish  30.0  hyd      Apple
3       30  36.0  bbi      wipro

In [40]:
data1['Name'].fillna('Amol')

0     Ramesh
1     Suresh
2    Sathish
3       Amol
Name: Name, dtype: object

In [42]:
data1.fillna(30)

      Name   Age City    Company
0   Ramesh  30.0   30     Google
1   Suresh  33.0  hyd  microsoft
2  Sathish  30.0  hyd      Apple
3       30  36.0  bbi      wipro

In [ ]:
### Draw back:

In [ ]:
T avoid the we have some methods

- backfil

- bfill

- ffill

- pad

In [62]:
import warnings
warnings.filterwarnings('ignore')
data1.fillna(method='pad')

      Name   Age City    Company
0   Ramesh  30.0  NaN     Google
1   Suresh  33.0  hyd  microsoft
2  Sathish  33.0  hyd      Apple
3  Sathish  36.0  bbi      wipro

In [64]:
import warnings
warnings.filterwarnings('ignore')
data1.fillna(method='pad',axis=1)

      Name      Age  City    Company
0   Ramesh     30.0  30.0     Google
1   Suresh     33.0   hyd  microsoft
2  Sathish  Sathish   hyd      Apple
3      NaN     36.0   bbi      wipro

In [56]:
data1.backfill()

C:\Users\amol\AppData\Local\Temp\ipykernel_8840\1326046602.py:1: FutureWarning: DataFrame.backfill/Series.backfill is deprecated. Use DataFrame.bfill/Series.bfill instead
  data1.backfill()

      Name   Age City    Company
0   Ramesh  30.0  hyd     Google
1   Suresh  33.0  hyd  microsoft
2  Sathish  36.0  hyd      Apple
3      NaN  36.0  bbi      wipro

In [54]:
data1.bfill()

      Name   Age City    Company
0   Ramesh  30.0  hyd     Google
1   Suresh  33.0  hyd  microsoft
2  Sathish  36.0  hyd      Apple
3      NaN  36.0  bbi      wipro

In [52]:
data1.ffill()

      Name   Age City    Company
0   Ramesh  30.0  NaN     Google
1   Suresh  33.0  hyd  microsoft
2  Sathish  33.0  hyd      Apple
3  Sathish  36.0  bbi      wipro

In [58]:
import warnings
warnings.filterwarnings('ignore')
data1.pad()

C:\Users\amol\AppData\Local\Temp\ipykernel_8840\4034988491.py:1: FutureWarning: DataFrame.pad/Series.pad is deprecated. Use DataFrame.ffill/Series.ffill instead
  data1.pad()

      Name   Age City    Company
0   Ramesh  30.0  NaN     Google
1   Suresh  33.0  hyd  microsoft
2  Sathish  33.0  hyd      Apple
3  Sathish  36.0  bbi      wipro

In [ ]:
select the column
get the mean
apply fill na

In [78]:
age_mean=data1['Age'].mean()
print('age_mean',age_mean)
data1['Age'].fillna(age_mean)

age_mean 33.0

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

In [86]:
ciy_mode=data1['City'].mode()
ciy_mode

0    hyd
Name: City, dtype: object

In [88]:
conver singele value
ciy_mode=data1['City'].mode()
ciy_mode.values[0]

'hyd'

In [68]:
aa=data1['Age'].mean()
aa

33.0

In [80]:
data1['Age'].fillna(aa)

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

In [ ]:
#### impute class
  - undr sklearn we have imput

In [90]:
from sklearn import impute

In [91]:
dir(impute)

['KNNImputer',
 'MissingIndicator',
 'SimpleImputer',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__getattr__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '_base',
 '_knn',
 'typing']

In [96]:
import numpy as np
from sklearn.impute import KNNImputer
x=[[1,2,np.nan],[3,np.nan,3],[np.nan,60,5],[8,9,7]]
imputer = KNNImputer(n_neighbors=2,weights='uniform')
imputer.fit_transform(x)

array([[ 1. ,  2. ,  5. ],
       [ 3. , 31. ,  3. ],
       [ 5.5, 60. ,  5. ],
       [ 8. ,  9. ,  7. ]])

In [98]:
import numpy as np
from sklearn.impute import KNNImputer
x=[[1,2,np.nan],[3,np.nan,3],[np.nan,60,5],[8,9,7]]
imputer = KNNImputer(n_neighbors=2,weights='distance')
imputer.fit_transform(x)

array([[ 1.        ,  2.        ,  3.88888889],
       [ 3.        , 31.        ,  3.        ],
       [ 3.26253496, 60.        ,  5.        ],
       [ 8.        ,  9.        ,  7.        ]])

In [ ]:
distance method

euclidian
jaccord or jacobian
manhattan
cosine===RAG